In [1]:
import networkx
import pandas as pd
pd.set_option('max_rows', 400)
import matplotlib.pyplot as plt

In [163]:
df = pd.read_csv('suckas18-21.csv')
df = df.drop(columns=['intr'])
df = pd.DataFrame(df, columns=['Name','Networth','Nationality','Biz'])
groupedf = df.groupby(['Nationality','Biz','Name']).mean()
groupedf = pd.DataFrame(groupedf,columns=['Nationality','Biz','Name'])

G = networkx.from_pandas_edgelist(df,'Nationality','Name')

In [178]:
# plt.figure(figsize=(8,8))
# networkx.draw(G, with_labels=True, node_color='skyblue', width=.3, font_size=8)

In [177]:
new = df[['Name','Nationality','Biz']]

# G = networkx.from_pandas_edgelist(df,'Nationality','Name','Biz')
# plt.figure(figsize=(8,8))
# networkx.draw(G, with_labels=True, node_color='skyblue', width=.3, font_size=8)

In [187]:
df.iloc[[0,1]]

         Name  Networth    Nationality            Biz
0  Jeff Bezos     177.0  United States         Amazon
1   Elon Musk     151.0  United States  Tesla, SpaceX

In [195]:
df.loc[[0,1],['Name','Biz']]

         Name            Biz
0  Jeff Bezos         Amazon
1   Elon Musk  Tesla, SpaceX